run/icoDyMFoam/3dOscillatingDroplet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ( "libinterfaceTrackingFvMesh.so" "libinterfaceTrackingBCs.so" "libfvSchemes.so");

applicationClass    icoDyMFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             1;

deltaT              5e-05;

writeControl        timeStep;

writeInterval       50;

writeFormat         binary;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

writePrecision      15;

runTimeModifiable   yes;

/*functions*/
/*(*/
/*    correctPoints*/
/*    {*/
/*        type correctPoints;*/
/*    }*/
/*);*/

/*OptimisationSwitches*/
/*{*/
/*    quadricsFit 1;*/
/*}*/

// ************************************************************************* //
