run/icoDyMFoam/3dOscillatingDroplet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;

mu              mu [ 1 -1 -1 0 0 0 0 ] 0.01;

rho             rho [ 1 -3 0 0 0 0 0 ] 1.0;

sigma           sigma [ 0 3 -2 0 0 0 0 ] 100.0;


// ************************************************************************* //
