run/icoDyMFoam/3dOscillatingDroplet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default bdf2;//backward;//
}

gradSchemes
{
/*    default Gauss linear;*/
    default extendedLeastSquares 0.6;
}

divSchemes
{
    default Gauss linear;
/*    div(phi,U) Gauss linearUpwindV Gauss linear;*/
    div(phi,U) Gauss skewCorrected linearUpwindV extendedLeastSquares 0.6;
}

laplacianSchemes
{
    default Gauss linear patchCorrected;//skewCorrected 0.5 //corrected;//
}

interpolationSchemes
{
/*    default             linear;*/
    default             skewCorrected linear;
}

snGradSchemes
{
    default             patchCorrected;//skewCorrected 0.5;//
}

fluxRequired
{
    p;
    pcorr;
}

// ************************************************************************* //


// ************************************************************************* //
