run/icoDyMFoam/3dOscillatingDroplet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

/*    p*/
/*    {*/
/*        solver          GAMG;*/
/*        preconditioner*/
/*        {*/
/*            preconditioner GaussSeidel;*/
/*        };*/
/*        tolerance       1e-11;*/
/*        relTol          1e-6;*/
/*        smoother        GaussSeidel;*/
/*        nPreSweeps      0;*/
/*        nPostSweeps     2;*/
/*        nFinestSweeps   2;*/
/*        cacheAgglomeration false;*/
/*        nCellsInCoarsestLevel 32;*/
/*        agglomerator    algebraicPair;//faceAreaPair;//*/
/*        mergeLevels     1;*/
/*    }*/

    pcorr
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-4;
    }

    pFinal
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

/*    U*/
/*    {*/
/*        solver          BiCG;*/
/*        preconditioner  DILU;*/
/*        tolerance       3e-9;*/
/*        relTol          0;*/
/*        minIter         3;*/
/*    }*/

    U
    {
        solver          GMRES;
        nDirections     6;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
        minIter         5;
    }

    cellMotionU
    {
        solver          GMRES;
        nDirections     8;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    // p-U coupling
    nCorrectors                 3; // PISO loops
    nNonOrthogonalCorrectors    1;
    pRefPoint (10 0 0);
    pRefValue 0;

    // convergence control
    momentumTolerance           1e-3;
    innerTolerance              5e-5;
}

PIMPLE
{
    // p-U coupling
    nOuterCorrectors            3; // SIMPLEC loops
    nCorrectors                 2; // PISO loops
    nNonOrthogonalCorrectors    2;
    pRefPoint (10 0 0);
    pRefValue 0;

    // interface tracking
    adjustFluxFrequency         100;

    // convergence control
    momentumTolerance           1e-3;
    innerTolerance              5e-5;
}


relaxationFactors
{
    p 1;//0.4;
    U 1;//0.6;
}
// ************************************************************************* //
